# Data cleaning and merging dataframes

## Loading multiple datasets

### Classical way

Reading file by file

In [24]:
import pandas as pd

path = '../data/eniac/'
orderlines = pd.read_csv(path + 'orderlines.csv')
orders = pd.read_csv(path + 'orders.csv')
brands = pd.read_csv(path + 'brands.csv')
products = pd.read_csv(path + 'products.csv')

In [47]:
path + 'orderlines.csv'

'../data/eniac/orderlines.csv'

### Another way

Using `os` and a loop to read all the files from a directory. It's also possible to read only files with a certain extension (like `.csv`):

In [5]:
import pandas as pd
import os

In [100]:
next(os.walk('./'))

('./',
 ['empty-notebooks', '.ipynb_checkpoints'],
 ['4-initial-exploration-visualisations.ipynb',
  '0-markdown.ipynb',
  '3-data-quality-and-merges.ipynb',
  '1-data-exploration.ipynb',
  'create-product-categories.ipynb',
  '2-data-aggregation.ipynb',
  '3-data-quality-and-merges-guillem.ipynb',
  'Archive.zip',
  '2-data-aggregation-guillem.ipynb',
  '5-category-creation-and-pandas-pipe.ipynb'])

In [6]:
path = '../data/eniac/'
path, dirs, files = next(os.walk(path))
#print(files)

# remove non-csv files
for file in files:
    if not file.endswith("csv"):
        files.remove(file)

In [7]:
files

['products.csv', 'orders.csv', 'orderlines.csv', 'brands.csv']

In [8]:
orderlines.shape

(293983, 7)

In [9]:
# create empty list 
df_list = []

# append datasets to the list
for file in files:
    temp_df = pd.read_csv(path + file, sep=',')
    df_list.append(temp_df)

# show results
products, orders, orderlines, brands = df_list[0], df_list[1], df_list[2], df_list[3]

## Data quality

### Missing values

In [2]:
print("Hi\nI am a new line")

Hi
I am a new line

In [79]:
# products.loc[products.isna().sum(axis=1) > 0].head(30)

In [10]:
def check_missing_values(data): 
    print('Missing values:' + '\n' + str(data.isna().sum()))

In [11]:
for i in range(len(df_list)): 
    print(f'File name: {files[i]}')
    check_missing_values(df_list[i])
    print('\n')

File name: products.csv
Missing values:
sku             0
name            0
desc            7
price          46
promo_price     0
in_stock        0
type           50
dtype: int64


File name: orders.csv
Missing values:
order_id        0
created_date    0
total_paid      5
state           0
dtype: int64


File name: orderlines.csv
Missing values:
id                  0
id_order            0
product_id          0
product_quantity    0
sku                 0
unit_price          0
date                0
dtype: int64


File name: brands.csv
Missing values:
short    0
long     0
dtype: int64

### Duplicates

In [95]:
pd.DataFrame({
    'x':[1,2,3,3,2,3]
})

   x
0  1
1  2
2  3
3  3
4  2
5  3

In [92]:
pd.DataFrame({
    'x':[1,2,3,3,2,3]
}).duplicated().sum()

3

In [84]:
products.duplicated().sum()

8746

In [86]:
products.shape

(19326, 7)

In [87]:
8746 / 19326

0.4525509676084032

In [12]:
def check_duplicates(data): 
    print('Duplicated rows: ', data.duplicated().sum())

In [13]:
for i in range(len(df_list)): 
    print(f'File name: {files[i]}')
    check_missing_values(df_list[i])
    check_duplicates(df_list[i])
    print('\n')

File name: products.csv
Missing values:
sku             0
name            0
desc            7
price          46
promo_price     0
in_stock        0
type           50
dtype: int64
Duplicated rows:  8746


File name: orders.csv
Missing values:
order_id        0
created_date    0
total_paid      5
state           0
dtype: int64
Duplicated rows:  0


File name: orderlines.csv
Missing values:
id                  0
id_order            0
product_id          0
product_quantity    0
sku                 0
unit_price          0
date                0
dtype: int64
Duplicated rows:  0


File name: brands.csv
Missing values:
short    0
long     0
dtype: int64
Duplicated rows:  0

Based on our initial exploration we need to find a way to deal with our missing values. 

Do we have other problems like data inconsistency? 

* Example: problems with the `price` column in the `orderlines` dataframe.

### Data inconsistency (data types)

In [14]:
for i in range(len(df_list)): 
    
    print(f'File name: {files[i]}')
    check_missing_values(df_list[i])
    check_duplicates(df_list[i])
    df_list[i].info()
    print('\n')

File name: products.csv
Missing values:
sku             0
name            0
desc            7
price          46
promo_price     0
in_stock        0
type           50
dtype: int64
Duplicated rows:  8746
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19326 entries, 0 to 19325
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   sku          19326 non-null  object
 1   name         19326 non-null  object
 2   desc         19319 non-null  object
 3   price        19280 non-null  object
 4   promo_price  19326 non-null  object
 5   in_stock     19326 non-null  int64
 6   type         19276 non-null  object
dtypes: int64(1), object(6)
memory usage: 1.0+ MB


File name: orders.csv
Missing values:
order_id        0
created_date    0
total_paid      5
state           0
dtype: int64
Duplicated rows:  0
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 226909 entries, 0 to 226908
Data columns (total 4 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   order_id      226909 non-null  int64
 1   created_date  226909 non-null  object
 2   total_paid    226904 non-null  float64
 3   state         226909 non-null  object
dtypes: float64(1), int64(1), object(2)
memory usage: 6.9+ MB


File name: orderlines.csv
Missing values:
id                  0
id_order            0
product_id          0
product_quantity    0
sku                 0
unit_price          0
date                0
dtype: int64
Duplicated rows:  0
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 293983 entries, 0 to 293982
Data columns (total 7 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   id                293983 non-null  int64
 1   id_order          293983 non-null  int64
 2   product_id        293983 non-null  int64
 3   product_quantity  293983 non-null  int64
 4   sku               293983 non-null  object
 5   unit_price        293983 non-null  object
 6   date              293983 non-null  object
dtypes: int64(4), object(3)
memory usage: 15.7+ MB


File name: brands.csv
Missing values:
short    0
long     0
dtype: int64
Duplicated rows:  0
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 187 entries, 0 to 186
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   short   187 non-null    object
 1   long    187 non-null    object
dtypes: object(2)
memory usage: 3.0+ KB

Some aspects that do not make a lot of sense:

* **products**: 
    * `price` and `promo_price` are loaded as objects. They should be floats. 
    * Quite a lot of missing values: 
        * `description`: 7 missing values. Maybe that could be inferred from the product name?
        * `price`: the missing values could be filled from the `orderlines` dataset. But first we will need to clean it. 

    
* **orders**: 
    * `created_date` should have a date data type. Then, it would be a good quality check to see if the created date for `orders` mathces with the created dates for `orderlines`. 
    
    
* **orderlines**: 
    * `unit_price` has to be a float, something wrong there. 
    * `date` has to be transformed to a date data type. Then, as we said, check that it with matches with the `orders` dataset. 
    
    
* **brands**: looks fine. 


Where do we have to start? Since `orders` and `orderlines` seem very crucial to the analysis, we will start by checking that they match.

## Cleaning orders

In [15]:
# change date datatype
orders['created_date'] = pd.to_datetime(orders['created_date'])

Some data I could extract from here to do a data quality check with `orderlines`: 

* the sum of `total_paid` on both datasets should be the same
* the initial and last date should be the same

In [16]:
min(orders['created_date'])

Timestamp('2017-01-01 00:07:19')

In [17]:
max(orders['created_date'])

Timestamp('2018-03-14 13:58:36')

In [18]:
sum(orders['total_paid'])

nan

I forgot to deal with missing values on our orders dataset!

In [13]:
orders.isna().sum()

order_id        0
created_date    0
total_paid      5
state           0
dtype: int64

In [14]:
# let's filter them out
orders.loc[orders['total_paid'].isna()]

        order_id        created_date  total_paid    state
127701    427314 2017-11-20 18:54:39         NaN  Pending
132013    431655 2017-11-22 12:15:24         NaN  Pending
147316    447411 2017-11-27 10:32:37         NaN  Pending
148833    448966 2017-11-27 18:54:15         NaN  Pending
149434    449596 2017-11-27 21:52:08         NaN  Pending

In [26]:
orders.shape

(226909, 4)

These orders have a state of "Pending", so I can exclude them from our dataset. We are interested on the completed ones.

In [28]:
orders.dropna(inplace=True)

In [29]:
orders.shape

(226904, 4)

Now my dataset is clean. And the total paid is:

In [23]:
orders['total_paid'].sum()

129159615.07000001

## Cleaning orderlines

First let's transform our date time.

In [17]:
orderlines['date'] = pd.to_datetime(orderlines['date'])

In [18]:
min(orderlines['date'])
# orders: Timestamp('2017-01-01 00:07:19')

Timestamp('2017-01-01 00:07:19')

In [19]:
max(orderlines['date'])
# orders: Timestamp('2018-03-14 13:58:36')

Timestamp('2018-03-14 13:58:36')

Yes, it seems it match. Now let's test our total_paid. 

To get this value, we will have to calculate a new column, total price for each row. It would be `product_quantity` * `unit_price`. I can not multiply a two different types of data. So I will have to transform the unit price to a numeric one.

In [51]:
orderlines.sample(5)

,id,id_order,product_id,product_quantity,sku,unit_price,date
6248,1136197,305330,0,1,MOS0174,29.99,2017-01-09 00:56:26
190079,1479793,456449,0,1,BEL0264,14.99,2017-12-06 20:27:28
156455,1427646,434546,0,1,APP2086,1.178.59,2017-11-23 13:18:29
12157,1148536,310553,0,1,APP1611,1.631.99,2017-01-16 16:56:23
50345,1222002,343219,0,1,WAC0228,879.99,2017-04-04 17:20:10

In [20]:
orderlines['product_quantity'] * pd.to_numeric(orderlines['unit_price'])

ValueError: Unable to parse string "1.137.99" at position 6

While trying to transform this column to numeric an error appears. From the error message, "Unable to parse string "1.137.99" at position 6", it seems that our dataset has some problems with the thousands separators: they were encoded as dots, and python only admits one dot per number: the _decimal_ separator!

There are a lot of different ways to solve this problem. The first thing I will do is to count how many dots appear for each number using string operations. If price has more than one dot, I will consider it corrupted.

In [55]:
# we create a copy of the dataset
ol_temp = orderlines.copy()

In [60]:
orderlines['unit_price'].str.count('\.')

0         1
1         1
2         1
3         1
4         1
         ..
293978    1
293979    1
293980    1
293981    1
293982    1
Name: unit_price, Length: 293983, dtype: int64

In [61]:
# create a new column with the amount of dots in the unit_price column
ol_temp['dots'] = orderlines['unit_price'].str.count('\.')
ol_temp.head(3)

,id,id_order,product_id,product_quantity,sku,unit_price,date,dots
0,1119109,299539,0,1,OTT0133,18.99,2017-01-01 00:07:19,1
1,1119110,299540,0,1,LGE0043,399.00,2017-01-01 00:19:45,1
2,1119111,299541,0,1,PAR0071,474.05,2017-01-01 00:20:57,1

In [62]:
# show the rows with more than one dot
ol_temp.query('dots > 1')

,id,id_order,product_id,product_quantity,sku,unit_price,date,dots
6,1119115,299544,0,1,APP1582,1.137.99,2017-01-01 01:17:21,2
11,1119126,299549,0,1,PAC0929,2.565.99,2017-01-01 02:07:42,2
15,1119131,299553,0,1,APP1854,3.278.99,2017-01-01 02:14:47,2
43,1119195,299582,0,1,PAC0961,2.616.99,2017-01-01 08:54:00,2
59,1119214,299596,0,1,PAC1599,2.873.99,2017-01-01 09:53:11,2
...,...,...,...,...,...,...,...,...
293862,1649999,452946,0,1,APP2075,2.999.00,2018-03-14 13:03:33,2
293887,1650045,527321,0,1,PAC2148,3.497.00,2018-03-14 13:10:15,2
293889,1650050,527324,0,1,PAC2117,3.075.00,2018-03-14 13:10:56,2
293911,1650088,527342,0,1,APP2492,1.329.00,2018-03-14 13:24:51,2
293936,1650135,527364,0,1,APP2491,1.329.00,2018-03-14 13:36:13,2

Our theory about the thousands separators is confirmed. How can we solve this problem? 

My approach would be to remove all the dots for all the unit_prices, and then add a dot before the last 2 digits to all the rows. Then I will transform it into numeric values.

In [67]:
orderlines['unit_price'].str.replace('\.','', regex=True)

0          1899
1         39900
2         47405
3          6839
4          2374
          ...
293978     4299
293979    14158
293980      999
293981     1999
293982     1399
Name: unit_price, Length: 293983, dtype: object

In [73]:
orderlines = orderlines.assign(unit_price_nd = orderlines['unit_price'].str.replace('\.','', regex=True))
orderlines.head(5)

,id,id_order,product_id,product_quantity,sku,unit_price,date,unit_price_nd
0,1119109,299539,0,1,OTT0133,18.99,2017-01-01 00:07:19,1899
1,1119110,299540,0,1,LGE0043,399.00,2017-01-01 00:19:45,39900
2,1119111,299541,0,1,PAR0071,474.05,2017-01-01 00:20:57,47405
3,1119112,299542,0,1,WDT0315,68.39,2017-01-01 00:51:40,6839
4,1119113,299543,0,1,JBL0104,23.74,2017-01-01 01:06:38,2374

In [82]:
orderlines['unit_price_nd'].str[-2:][:5]

0    99
1    00
2    05
3    39
4    74
Name: unit_price_nd, dtype: object

In [83]:
orderlines['unit_price_nd'].str[:-2][:5]

0     18
1    399
2    474
3     68
4     23
Name: unit_price_nd, dtype: object

In [85]:
orderlines['integers'] = orderlines['unit_price_nd'].str[:-2]
orderlines['digits'] = orderlines['unit_price_nd'].str[-2:]
orderlines.head()

,id,id_order,product_id,product_quantity,sku,unit_price,date,unit_price_nd,digits,integers
0,1119109,299539,0,1,OTT0133,18.99,2017-01-01 00:07:19,1899,99,18
1,1119110,299540,0,1,LGE0043,399.00,2017-01-01 00:19:45,39900,00,399
2,1119111,299541,0,1,PAR0071,474.05,2017-01-01 00:20:57,47405,05,474
3,1119112,299542,0,1,WDT0315,68.39,2017-01-01 00:51:40,6839,39,68
4,1119113,299543,0,1,JBL0104,23.74,2017-01-01 01:06:38,2374,74,23

In [86]:
orderlines['new_unit_price'] = orderlines['integers'] + '.' + orderlines['digits']
orderlines.head()

,id,id_order,product_id,product_quantity,sku,unit_price,date,unit_price_nd,digits,integers,new_unit_price
0,1119109,299539,0,1,OTT0133,18.99,2017-01-01 00:07:19,1899,99,18,18.99
1,1119110,299540,0,1,LGE0043,399.00,2017-01-01 00:19:45,39900,00,399,399.00
2,1119111,299541,0,1,PAR0071,474.05,2017-01-01 00:20:57,47405,05,474,474.05
3,1119112,299542,0,1,WDT0315,68.39,2017-01-01 00:51:40,6839,39,68,68.39
4,1119113,299543,0,1,JBL0104,23.74,2017-01-01 01:06:38,2374,74,23,23.74

In [87]:
orderlines.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 293983 entries, 0 to 293982
Data columns (total 11 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   id                293983 non-null  int64
 1   id_order          293983 non-null  int64
 2   product_id        293983 non-null  int64
 3   product_quantity  293983 non-null  int64
 4   sku               293983 non-null  object
 5   unit_price        293983 non-null  object
 6   date              293983 non-null  object
 7   unit_price_nd     293983 non-null  object
 8   digits            293983 non-null  object
 9   integers          293983 non-null  object
 10  new_unit_price    293983 non-null  object
dtypes: int64(4), object(7)
memory usage: 24.7+ MB

In [88]:
# last step is to transform it to numeric
orderlines['unit_price'] = pd.to_numeric(orderlines['new_unit_price'])
orderlines.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 293983 entries, 0 to 293982
Data columns (total 11 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   id                293983 non-null  int64
 1   id_order          293983 non-null  int64
 2   product_id        293983 non-null  int64
 3   product_quantity  293983 non-null  int64
 4   sku               293983 non-null  object
 5   unit_price        293983 non-null  float64
 6   date              293983 non-null  object
 7   unit_price_nd     293983 non-null  object
 8   digits            293983 non-null  object
 9   integers          293983 non-null  object
 10  new_unit_price    293983 non-null  object
dtypes: float64(1), int64(4), object(6)
memory usage: 24.7+ MB

Now it is time to see if it is the same than the orders files.

In [93]:
#orderlines.drop(['unit_price_nd','digits','integers','new_unit_price'], axis=1, inplace=True)
orderlines['total_price'] = orderlines['product_quantity'] * orderlines['unit_price']
orderlines.sample(5)

,id,id_order,product_id,product_quantity,sku,unit_price,date,total_price
152040,1420317,431136,0,1,APP0663,229.99,2017-11-22 07:19:00,229.99
223519,1537171,481882,0,1,MOS0237,19.99,2018-01-04 13:58:12,19.99
262063,1599354,505585,0,1,APP0662,159.00,2018-02-04 19:13:25,159.00
62056,1242302,353038,0,1,APP0927,14.99,2017-05-05 16:21:30,14.99
57280,1234070,349114,0,2,SAM0116,114.99,2017-04-24 09:31:58,229.98

In [94]:
orders.head()

   order_id         created_date  total_paid      state
0    241319  2017-01-02 13:35:40       44.99  Cancelled
1    241423  2017-11-06 13:10:02      136.15  Completed
2    242832  2017-12-31 17:40:03       15.76  Completed
3    243330  2017-02-16 10:59:38       84.98  Completed
4    243784  2017-11-24 13:35:19      157.86  Cancelled

In [96]:
sum(orderlines['total_price'])
# 129159615.07000001

128776222.0298095

In [97]:
sum(orders['total_paid'])

129159615.06991275

What!? After all this work the values do not match! How can we figure it out where is the problem?

## Matching `orders` and `orderlines`

It is possible that some orders exist in one dataset but not in the other one. This would be a potential source for this price mismatch. Let's solve it!

We first create a new column in the `orderlines` dataset using `assign`. We also use `isin()` to create a boolen value (True/False) that checks whether the `id_order` is present in the `orders` dataset:

In [100]:
(
orderlines
    .assign(check_orders = orderlines['id_order'].isin(orders['order_id']))
)['check_orders'].sum()

293743

In [101]:
orderlines.shape

(293983, 8)

Then, using `.query` we select rows where the value in this new column is `False`:

In [104]:
(
orderlines
    .assign(check_orders = orderlines['id_order'].isin(orders['order_id']))
    .query("check_orders==False")
)

,id,id_order,product_id,product_quantity,sku,unit_price,date,total_price,check_orders
5,1119114,295310,0,10,WDT0249,231.79,2017-01-01 01:14:27,2317.90,False
63,1119218,296284,0,1,BNQ0042,699.00,2017-01-01 09:58:35,699.00,False
67,1119223,294806,0,1,APP1849,2558.99,2017-01-01 10:09:15,2558.99,False
69,1119226,294806,0,1,APP1864,2797.99,2017-01-01 10:15:14,2797.99,False
70,1119235,297261,0,1,QNA0177,304.99,2017-01-01 10:17:59,304.99,False
...,...,...,...,...,...,...,...,...,...
275665,1621177,244328,0,1,OWC0260,349.00,2018-02-20 13:00:45,349.00,False
280055,1628699,261391,0,1,APP2352,3343.00,2018-02-27 11:43:25,3343.00,False
280352,1629247,287797,0,1,SYN0182,484.11,2018-02-27 19:16:26,484.11,False
280856,1630150,261391,0,1,SAT0091,44.99,2018-02-28 12:18:26,44.99,False
280869,1630178,261391,0,1,SAT0062,49.99,2018-02-28 12:30:57,49.99,False

It looks like 240 rows in `orderlines` come from orders not present in the `orders` dataset. This is quite inconsistent, since the `orders` dataset should be the one and only source of truth for orders: if an order is not there, it should not exist. We will try to find out why that happened, but for now, let's just remove those "ghost" orders:

In [105]:
orderlines.shape

(293983, 8)

In [106]:
orderlines = (
orderlines
    .assign(check_orders = orderlines.id_order.isin(orders.order_id))
    .query("check_orders==True")
)

In [107]:
orderlines.shape

(293743, 9)

Now let's look at this problem in the opposite direction: are there orders in the `orders` dataset not prsent in `orderlines`?

In [108]:
(
orders
    .assign(check_orders = orders['order_id'].isin(orderlines['id_order']))
    .query("check_orders==False")
)

,order_id,created_date,total_paid,state,check_orders
8,245941,2017-01-01 10:32:23,183.52,Completed,False
65,268629,2017-01-31 11:27:25,73.23,Completed,False
75,272862,2017-04-18 18:17:10,128.99,Pending,False
82,277655,2017-02-01 08:44:55,9.99,Pending,False
83,277994,2017-01-23 18:30:11,52.99,Completed,False
...,...,...,...,...,...
226835,527328,2018-03-14 13:14:12,0.00,Shopping Basket,False
226851,527344,2018-03-14 13:25:21,0.00,Place Order,False
226853,527346,2018-03-14 13:26:14,0.00,Place Order,False
226855,527348,2018-03-14 13:28:18,0.00,Place Order,False
226889,527382,2018-03-14 13:47:43,0.00,Shopping Basket,False

There are more than 22000 orders in the `orders` dataset that are not present on the `orderlines` dataset!!! We can try to find out why by looking at the state of these orders:

In [110]:
(orders
 .assign(check_orders = orders.order_id.isin(orderlines.id_order))
 .query("check_orders==False")
 ['state'].value_counts()
)

Place Order        12304
Shopping Basket     9810
Completed             45
Cancelled             41
Pending               13
Name: state, dtype: int64

It looks like most of them are orders that were not fully completed: the products were left in the shopping basket or the order was "placed" but maybe not paid (hence the state "Place Order". Some of them were "Completed", though. 

This will require further research, and we might have to come back to these orders if we have to explore consumer behaviour (e.g. why are orders left in the shopping basket?), but for now, for the sake of data quality, let's drop all of these unmatched orders:

In [112]:
orders = (orders.
          assign(check_orders = orders.order_id.isin(orderlines.id_order)).
          query("check_orders==True")
         )

Let's now check again if the total paid matches:

In [113]:
orders.total_paid.sum()

129130877.18

In [114]:
orderlines.total_price.sum()

128659393.77

STILL NOT MATCHING!!! This is outrageous. Let's keep exploring.

## Solving the price mismatch

Let's merge both datasets and compare, order by order, the `total_price`. We will call this new merged dataset `orders_info`.

*Note: To merge `orderlines` with `orders`, we have to group and aggregate `orderlines`!

In [120]:
orders_info = (
orderlines
    .groupby('id_order')
    .agg({'total_price':'sum'})
    .reset_index()
    .merge(orders, how='left', left_on='id_order', right_on='order_id')
    .copy()
)
orders_info

,id_order,total_price,order_id,created_date,total_paid,state,check_orders
0,241319,44.99,241319,2017-01-02 13:35:40,44.99,Cancelled,True
1,241423,129.16,241423,2017-11-06 13:10:02,136.15,Completed,True
2,242832,10.77,242832,2017-12-31 17:40:03,15.76,Completed,True
3,243330,77.99,243330,2017-02-16 10:59:38,84.98,Completed,True
4,243784,153.87,243784,2017-11-24 13:35:19,157.86,Cancelled,True
...,...,...,...,...,...,...,...
204686,527397,42.99,527397,2018-03-14 13:56:38,42.99,Place Order,True
204687,527398,42.99,527398,2018-03-14 13:57:25,42.99,Shopping Basket,True
204688,527399,141.58,527399,2018-03-14 13:57:34,141.58,Shopping Basket,True
204689,527400,19.98,527400,2018-03-14 13:57:41,19.98,Shopping Basket,True
204690,527401,13.99,527401,2018-03-14 13:58:36,18.98,Place Order,True

Now that the `total` from both datasets is in the same dataframe, we can create a new column with the difference:

In [126]:
orders_info['price_difference'] = orders_info['total_paid'] - orders_info['total_price']
orders_info.query('state == "Completed"').sample(10)

,id_order,total_price,order_id,created_date,total_paid,state,check_orders,price_difference
95717,404768,169.98,404768,2017-09-26 11:40:08,174.97,Completed,True,4.99
145875,460978,30.99,460978,2017-12-13 16:49:13,35.98,Completed,True,4.99
146545,461698,23.96,461698,2017-12-13 11:42:42,28.95,Completed,True,4.99
43669,346922,154.99,346922,2017-04-18 09:00:02,154.99,Completed,True,0.00
104405,414552,136.96,414552,2017-10-19 17:21:50,143.95,Completed,True,6.99
8938,309252,56.97,309252,2017-01-14 10:53:56,55.96,Completed,True,-1.01
144146,459054,60.96,459054,2017-12-10 18:39:29,65.95,Completed,True,4.99
140640,455312,29.99,455312,2017-12-04 22:47:03,36.98,Completed,True,6.99
61808,366751,343.97,366751,2017-06-18 15:54:05,348.96,Completed,True,4.99
22286,323899,69.99,323899,2017-02-14 03:48:43,73.98,Completed,True,3.99

In [127]:
orders_info.price_difference.describe()

count    204691.000000
mean          2.303391
std         297.461827
min      -36159.900000
25%           0.000000
50%           0.000000
75%           0.010000
max       90898.610000
Name: price_difference, dtype: float64

In [156]:
temp = (
orders_info
    .assign(price_diff = round(orders_info['total_paid'] - orders_info['total_price'], 2))
    ['price_diff']
    .unique()
    .tolist()
)

pd.DataFrame({
    'x':temp
}).sort_values(by='x').head(50)

Looks like the maximum and minimun price differences are huge: some orders are really corrupted. But we also see from the mean and the quartiles that the price difference is neglegible for most orders.

## Challenge: Remove outliers

Decide on a criteria for removing orders whenever you cannot trust the price difference between `orders` and `orderlines`.

In [38]:
# code here

Save the data once you are sure you can trust it!

In [39]:
orderlines.to_csv(path + 'clean/orderlines_cl.csv', index=False)
orders.to_csv(path + 'clean/orders_cl.csv', index=False)

## Challenge: Cleaning products

Now it is time to clean the products dataset. Let's do a quick review of the things where wrong:

In [43]:
print(products.info())
check_duplicates(products)
check_missing_values(products)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19326 entries, 0 to 19325
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   sku          19326 non-null  object
 1   name         19326 non-null  object
 2   desc         19319 non-null  object
 3   price        19280 non-null  object
 4   promo_price  19326 non-null  object
 5   in_stock     19326 non-null  int64
 6   type         19276 non-null  object
dtypes: int64(1), object(6)
memory usage: 1.0+ MB
None
Duplicated rows:  8746
Missing values:
sku             0
name            0
desc            7
price          46
promo_price     0
in_stock        0
type           50
dtype: int64

Looking at this overview, we can see that there are different things that has to be changed: 

* Data types: 
    * price should be a float
    * promo price should be a float
* Duplicated rows. They have to be removed. 
    * To accomplish this step you can use the method `pd.DataFrame.drop_duplicates()`. Be sure you drop all the duplicates based on the column **sku**, as it is the one you will use to merge with orderlines. 
* Missing values: 
    * Description may be can be infered by the name
    * price. Is there a way we can extract the information from another table?
    * type. Do we need this column for our analysis?
    
This task can be accomoplished by using all the methods you already know.

### Start of the challenge

In [44]:
# code here

## Brands

The brands csv looks fine, so we can work together with it.

In [45]:
brands.to_csv(path + 'clean/brands.csv', index=False)